tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1769_tdd.h
#define ANSELA                        522
#define ANSA0                         523
#define ANSA1                         524
#define ANSA2                         525
#define ANSA4                         526
#define ANSELB                        527
#define ANSB4                         528
#define ANSB5                         529
#define ANSB6                         530
#define ANSB7                         531
#define ANSELC                        532
#define ANSC0                         533
#define ANSC1                         534
#define ANSC2                         535
#define ANSC3                         536
#define ANSC6                         537
#define ANSC7                         538
#define PMADRL                        539
#define PMADRH                        540
#define PMDATL                        541
#define PMDATH                        542
#define PMCON1                        543
#define RD                            544
#define WR                            545
#define WREN                          546
#define WRERR                         547
#define FREE                          548
#define LWLO                          549
#define CFGS                          550
#define PMCON2                        551
#define VREGCON                       552
#define VREGPM                        553
#define RC1REG                        554
#define TX1REG                        555
#define SP1BRGL                       556
#define SP1BRGH                       557
#define RC1STA                        558
#define RX9D                          559
#define OERR                          560
#define FERR                          561
#define ADDEN                         562
#define CREN                          563
#define SREN                          564
#define RX9                           565
#define SPEN                          566
#define TX1STA                        567
#define TX9D                          568
#define TRMT                          569
#define BRGH                          570
#define SENDB                         571
#define TX1STA_SYNC                   572
#define TXEN                          573
#define TX9                           574
#define CSRC                          575
#define BAUD1CON                      576
#define ABDEN                         577
#define WUE                           578
#define BRG16                         579
#define SCKP                          580
#define RCIDL                         581
#define ABDOVF                        582
#define WPUA                          583
#define WPUA0                         584
#define WPUA1                         585
#define WPUA2                         586
#define WPUA3                         587
#define WPUA4                         588
#define WPUA5                         589
#define WPUB                          590
#define WPUB4                         591
#define WPUB5                         592
#define WPUB6                         593
#define WPUB7                         594
#define WPUC                          595
#define WPUC0                         596
#define WPUC1                         597
#define WPUC2                         598
#define WPUC3                         599
#define WPUC4                         600
#define WPUC5                         601
#define WPUC6                         602
#define WPUC7                         603
#define SSP1BUF                       604
#define BUF                           605
#define BUF0                          606
#define SSP1BUF0                      607
#define BUF1                          608
#define SSP1BUF1                      609
#define BUF2                          610
#define SSP1BUF2                      611
#define BUF3                          612
#define SSP1BUF3                      613
#define BUF4                          614
#define SSP1BUF4                      615
#define BUF5                          616
#define SSP1BUF5                      617
#define BUF6                          618
#define SSP1BUF6                      619
#define BUF7                          620
#define SSP1BUF7                      621
#define ADD0                          622
#define ADD                           623
#define SSP1ADD0                      624
#define SSP1ADD                       625
#define ADD1                          626
#define SSP1ADD1                      627
#define ADD2                          628
#define SSP1ADD2                      629
#define ADD3                          630
#define SSP1ADD3                      631
#define ADD4                          632
#define SSP1ADD4                      633
#define ADD5                          634
#define SSP1ADD5                      635
#define ADD6                          636
#define SSP1ADD6                      637
#define ADD7                          638
#define SSP1ADD7                      639
#define SSP1MSK0                      640
#define SSP1MSK                       641
#define MSK0                          642
#define MSK                           643
#define SSP1MSK1                      644
#define MSK1                          645
#define SSP1MSK2                      646
#define MSK2                          647
#define SSP1MSK3                      648
#define MSK3                          649
#define SSP1MSK4                      650
#define MSK4                          651
#define SSP1MSK5                      652
#define MSK5                          653
#define SSP1MSK6                      654
#define MSK6                          655
#define SSP1MSK7                      656
#define MSK7                          657
#define SSP1STAT                      658
#define BF                            659
#define UA                            660
#define R_nW                          661
#define S                             662
#define P                             663
#define D_nA                          664
#define CKE                           665
#define SMP                           666
#define SSP1CON1                      667
#define SSPM0                         668
#define SSPM                          669
#define SSPM1                         670
#define SSPM2                         671
#define SSPM3                         672
#define CKP                           673
#define SSPEN                         674
#define SSPOV                         675
#define WCOL                          676
#define SSP1CON2                      677
#define SEN                           678
#define RSEN                          679
#define PEN                           680
#define RCEN                          681
#define ACKEN                         682
#define ACKDT                         683
#define ACKSTAT                       684
#define GCEN                          685
#define SSP1CON3                      686
#define DHEN                          687
#define AHEN                          688
#define SBCDE                         689
#define SDAHT                         690
#define BOEN                          691
#define SCIE                          692
#define PCIE                          693
#define ACKTIM                        694
#define BORCON                        695
#define BORRDY                        696
#define BORFS                         697
#define SBOREN                        698
#define FVRCON                        699
#define ADFVR                         700
#define CDAFVR                        701
#define TSRNG                         702
#define TSEN                          703
#define FVRRDY                        704
#define FVREN                         705
#define ZCD1CON                       706
#define ZCD1INTN                      707
#define ZCD1INTP                      708
#define ZCD1POL                       709
#define ZCD1OUT                       710
#define ZCD1EN                        711
#define ODCONA                        712
#define ODA0                          713
#define ODA1                          714
#define ODA2                          715
#define ODA4                          716
#define ODA5                          717
#define ODCONB                        718
#define ODB4                          719
#define ODB5                          720
#define ODB6                          721
#define ODB7                          722
#define ODCONC                        723
#define ODC0                          724
#define ODC1                          725
#define ODC2                          726
#define ODC3                          727
#define ODC4                          728
#define ODC5                          729
#define ODC6                          730
#define ODC7                          731
#define CCPR1L                        732
#define CCPR1L_RL                     733
#define CCPR1H                        734
#define CCPR1H_RH                     735
#define CCP1CON                       736
#define CCP1MODE0                     737
#define CCP1CON_MODE0                 738
#define CCP1CON_MODE                  739
#define CCP1MODE                      740
#define CCP1MODE1                     741
#define CCP1CON_MODE1                 742
#define CCP1MODE2                     743
#define CCP1CON_MODE2                 744
#define CCP1MODE3                     745
#define CCP1CON_MODE3                 746
#define CCP1CON_FMT                   747
#define CCP1FMT                       748
#define CCP1CON_OUT                   749
#define CCP1OUT                       750
#define CCP1EN                        751
#define CCP1CON_EN                    752
#define CCP1CAP                       753
#define CCP1CTS0                      754
#define CCP1CAP_CTS                   755
#define CCP1CAP_CTS0                  756
#define CCP1CTS                       757
#define CCP1CTS1                      758
#define CCP1CAP_CTS1                  759
#define CCP1CTS2                      760
#define CCP1CAP_CTS2                  761
#define CCPR2L                        762
#define CCPR2L_RL                     763
#define CCPR2H                        764
#define CCPR2H_RH                     765
#define CCP2CON                       766
#define CCP2MODE                      767
#define CCP2MODE0                     768
#define CCP2CON_MODE0                 769
#define CCP2CON_MODE                  770
#define CCP2MODE1                     771
#define CCP2CON_MODE1                 772
#define CCP2MODE2                     773
#define CCP2CON_MODE2                 774
#define CCP2MODE3                     775
#define CCP2CON_MODE3                 776
#define CCP2FMT                       777
#define CCP2CON_FMT                   778
#define CCP2OUT                       779
#define CCP2CON_OUT                   780
#define CCP2EN                        781
#define CCP2CON_EN                    782
#define CCP2CAP                       783
#define CCP2CAP_CTS                   784
#define CCP2CAP_CTS0                  785
#define CCP2CTS                       786
#define CCP2CTS0                      787
#define CCP2CAP_CTS1                  788
#define CCP2CTS1                      789
#define CCP2CAP_CTS2                  790
#define CCP2CTS2                      791
#define CCPTMRS                       792
#define C1TSEL0                       793
#define C1TSEL                        794
#define C1TSEL1                       795
#define C2TSEL0                       796
#define C2TSEL                        797
#define C2TSEL1                       798
#define P3TSEL                        799
#define P3TSEL0                       800
#define P3TSEL1                       801
#define P4TSEL0                       802
#define P4TSEL                        803
#define P4TSEL1                       804
#define SLRCONA                       805
#define SLRA0                         806
#define SLRA1                         807
#define SLRA2                         808
#define SLRA4                         809
#define SLRA5                         810
#define SLRCONB                       811
#define SLRB4                         812
#define SLRB5                         813
#define SLRB6                         814
#define SLRB7                         815
#define SLRCONC                       816
#define SLRC0                         817
#define SLRC1                         818
#define SLRC2                         819
#define SLRC3                         820
#define SLRC4                         821
#define SLRC5                         822
#define SLRC6                         823
#define SLRC7                         824
#define MD2CON0                       825
#define MD2BIT                        826
#define MD2CON0_BIT                   827
#define MD2CON0_OPOL                  828
#define MD2OPOL                       829
#define MD2CON0_OUT                   830
#define MD2OUT                        831
#define MD2CON0_EN                    832
#define MD2EN                         833
#define MD2CON1                       834
#define MD2CLSYNC                     835
#define MD2CON1_CLSYNC                836
#define MD2CON1_CLPOL                 837
#define MD2CLPOL                      838
#define MD2CON1_CHSYNC                839
#define MD2CHSYNC                     840
#define MD2CHPOL                      841
#define MD2CON1_CHPOL                 842
#define MD2SRC                        843
#define MD2MS                         844
#define MD2MS0                        845
#define MD2SRC_MS0                    846
#define MD2SRC_MS                     847
#define MD2SRC_MS1                    848
#define MD2MS1                        849
#define MD2MS2                        850
#define MD2SRC_MS2                    851
#define MD2MS3                        852
#define MD2SRC_MS3                    853
#define MD2MS4                        854
#define MD2SRC_MS4                    855
#define MD2CARL                       856
#define MD2CARL_CL                    857
#define MD2CARL_CL0                   858
#define MD2CL0                        859
#define MD2CL                         860
#define MD2CARL_CL1                   861
#define MD2CL1                        862
#define MD2CL2                        863
#define MD2CARL_CL2                   864
#define MD2CL3                        865
#define MD2CARL_CL3                   866
#define MD2CARH                       867
#define MD2CARH_CH0                   868
#define MD2CH0                        869
#define MD2CARH_CH                    870
#define MD2CH                         871
#define MD2CARH_CH1                   872
#define MD2CH1                        873
#define MD2CARH_CH2                   874
#define MD2CH2                        875
#define MD2CARH_CH3                   876
#define MD2CH3                        877
#define INLVLA                        878
#define INLVLA0                       879
#define INLVLA1                       880
#define INLVLA2                       881
#define INLVLA3                       882
#define INLVLA4                       883
#define INLVLA5                       884
#define INLVLB                        885
#define INLVLB4                       886
#define INLVLB5                       887
#define INLVLB6                       888
#define INLVLB7                       889
#define INLVLC                        890
#define INLVLC0                       891
#define INLVLC1                       892
#define INLVLC2                       893
#define INLVLC3                       894
#define INLVLC4                       895
#define INLVLC5                       896
#define INLVLC6                       897
#define INLVLC7                       898
#define IOCAP                         899
#define IOCAP0                        900
#define IOCAP1                        901
#define IOCAP2                        902
#define IOCAP3                        903
#define IOCAP4                        904
#define IOCAP5                        905
#define IOCAN                         906
#define IOCAN0                        907
#define IOCAN1                        908
#define IOCAN2                        909
#define IOCAN3                        910
#define IOCAN4                        911
#define IOCAN5                        912
#define IOCAF                         913
#define IOCAF0                        914
#define IOCAF1                        915
#define IOCAF2                        916
#define IOCAF3                        917
#define IOCAF4                        918
#define IOCAF5                        919
#define IOCBP                         920
#define IOCBP4                        921
#define IOCBP5                        922
#define IOCBP6                        923
#define IOCBP7                        924
#define IOCBN                         925
#define IOCBN4                        926
#define IOCBN5                        927
#define IOCBN6                        928
#define IOCBN7                        929
#define IOCBF                         930
#define IOCBF4                        931
#define IOCBF5                        932
#define IOCBF6                        933
#define IOCBF7                        934
#define IOCCP                         935
#define IOCCP0                        936
#define IOCCP1                        937
#define IOCCP2                        938
#define IOCCP3                        939
#define IOCCP4                        940
#define IOCCP5                        941
#define IOCCP6                        942
#define IOCCP7                        943
#define IOCCN                         944
#define IOCCN0                        945
#define IOCCN1                        946
#define IOCCN2                        947
#define IOCCN3                        948
#define IOCCN4                        949
#define IOCCN5                        950
#define IOCCN6                        951
#define IOCCN7                        952
#define IOCCF                         953
#define IOCCF0                        954
#define IOCCF1                        955
#define IOCCF2                        956
#define IOCCF3                        957
#define IOCCF4                        958
#define IOCCF5                        959
#define IOCCF6                        960
#define IOCCF7                        961
#define MD1CON0                       962
#define MD1BIT                        963
#define MD1CON0_BIT                   964
#define MD1CON0_OPOL                  965
#define MD1OPOL                       966
#define MD1CON0_OUT                   967
#define MD1OUT                        968
#define MD1CON0_EN                    969
#define MD1EN                         970
#define MD1CON1                       971
#define MD1CLSYNC                     972
#define MD1CON1_CLSYNC                973
#define MD1CON1_CLPOL                 974
#define MD1CLPOL                      975
#define MD1CON1_CHSYNC                976
#define MD1CHSYNC                     977
#define MD1CHPOL                      978
#define MD1CON1_CHPOL                 979
#define MD1SRC                        980
#define MD1MS0                        981
#define MD1SRC_MS0                    982
#define MD1MS                         983
#define MD1SRC_MS                     984
#define MD1MS1                        985
#define MD1SRC_MS1                    986
#define MD1MS2                        987
#define MD1SRC_MS2                    988
#define MD1MS3                        989
#define MD1SRC_MS3                    990
#define MD1MS4                        991
#define MD1SRC_MS4                    992
#define MD1CARL                       993
#define MD1CL                         994
#define MD1CARL_CL0                   995
#define MD1CL0                        996
#define MD1CARL_CL                    997
#define MD1CARL_CL1                   998
#define MD1CL1                        999
#define MD1CARL_CL2                   1000
#define MD1CL2                        1001
#define MD1CARL_CL3                   1002
#define MD1CL3                        1003
#define MD1CARH                       1004
#define MD1CARH_CH                    1005
#define MD1CH                         1006
#define MD1CH0                        1007
#define MD1CARH_CH0                   1008
#define MD1CH1                        1009
#define MD1CARH_CH1                   1010
#define MD1CH2                        1011
#define MD1CARH_CH2                   1012
#define MD1CH3                        1013
#define MD1CARH_CH3                   1014
#define HIDRVC                        1015
#define HIDC4                         1016
#define HIDC5                         1017
#define T4TMR                         1018
#define TMR4                          1019
#define T4TMR_TMR                     1020
#define T4PR_PR                       1021
#define T4PR                          1022
#define T4CON                         1023
#define T4CON_OUTPS                   1024
#define T4OUTPS0                      1025
#define T4OUTPS                       1026
#define T4CON_OUTPS0                  1027
#define T4OUTPS1                      1028
#define T4CON_OUTPS1                  1029
#define T4CON_OUTPS2                  1030
#define T4OUTPS2                      1031
#define T4OUTPS3                      1032
#define T4CON_OUTPS3                  1033
#define T4CKPS0                       1034
#define T4CON_CKPS0                   1035
#define T4CKPS                        1036
#define T4CON_CKPS                    1037
#define T4CKPS1                       1038
#define T4CON_CKPS1                   1039
#define T4CKPS2                       1040
#define T4CON_CKPS2                   1041
#define T4CON_ON                      1042
#define T4ON                          1043
#define TMR4ON                        1044
#define T4HLT                         1045
#define T4MODE                        1046
#define T4HLT_MODE                    1047
#define T4HLT_MODE0                   1048
#define T4MODE0                       1049
#define T4HLT_MODE1                   1050
#define T4MODE1                       1051
#define T4HLT_MODE2                   1052
#define T4MODE2                       1053
#define T4HLT_MODE3                   1054
#define T4MODE3                       1055
#define T4HLT_MODE4                   1056
#define T4MODE4                       1057
#define T4CKSYNC                      1058
#define T4HLT_CKSYNC                  1059
#define T4HLT_CKPOL                   1060
#define T4CKPOL                       1061
#define T4PSYNC                       1062
#define T4HLT_PSYNC                   1063
#define T4CLKCON                      1064
#define T4CS                          1065
#define T4CLKCON_CS                   1066
#define T4CS0                         1067
#define T4CLKCON_CS0                  1068
#define T4CS1                         1069
#define T4CLKCON_CS1                  1070
#define T4CS2                         1071
#define T4CLKCON_CS2                  1072
#define T4CS3                         1073
#define T4CLKCON_CS3                  1074
#define T4RST                         1075
#define T4RSEL0                       1076
#define T4RSEL                        1077
#define T4RST_RSEL                    1078
#define T4RST_RSEL0                   1079
#define T4RSEL1                       1080
#define T4RST_RSEL1                   1081
#define T4RSEL2                       1082
#define T4RST_RSEL2                   1083
#define T4RSEL3                       1084
#define T4RST_RSEL3                   1085
#define T6TMR                         1086
#define TMR6                          1087
#define T6TMR_TMR                     1088
#define T6PR_PR                       1089
#define T6PR                          1090
