tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1769_tdd.h
#define COG2ASD0_ASREN                2207
#define G2ASREN                       2208
#define COG2ASD0_ASE                  2209
#define G2ASE                         2210
#define COG2ASD1                      2211
#define COG2ASD1_AS0E                 2212
#define G2AS0E                        2213
#define G2AS1E                        2214
#define COG2ASD1_AS1E                 2215
#define COG2ASD1_AS2E                 2216
#define G2AS2E                        2217
#define G2AS3E                        2218
#define COG2ASD1_AS3E                 2219
#define COG2ASD1_AS4E                 2220
#define G2AS4E                        2221
#define COG2ASD1_AS5E                 2222
#define G2AS5E                        2223
#define G2AS6E                        2224
#define COG2ASD1_AS6E                 2225
#define COG2ASD1_AS7E                 2226
#define G2AS7E                        2227
#define COG2STR                       2228
#define COG2STR_STRA                  2229
#define G2STRA                        2230
#define COG2STR_STRB                  2231
#define G2STRB                        2232
#define COG2STR_STRC                  2233
#define G2STRC                        2234
#define COG2STR_STRD                  2235
#define G2STRD                        2236
#define COG2STR_SDATA                 2237
#define G2SDATA                       2238
#define COG2STR_SDATB                 2239
#define G2SDATB                       2240
#define COG2STR_SDATC                 2241
#define G2SDATC                       2242
#define COG2STR_SDATD                 2243
#define G2SDATD                       2244
#define PRG1RTSS                      2245
#define RG1RTSS0                      2246
#define PRG1RTSS_RTSS                 2247
#define PRG1RTSS_RTSS0                2248
#define RG1RTSS1                      2249
#define PRG1RTSS_RTSS1                2250
#define RG1RTSS2                      2251
#define PRG1RTSS_RTSS2                2252
#define RG1RTSS3                      2253
#define PRG1RTSS_RTSS3                2254
#define PRG1FTSS                      2255
#define RG1FTSS0                      2256
#define PRG1FTSS_FTSS                 2257
#define PRG1FTSS_FTSS0                2258
#define RG1FTSS1                      2259
#define PRG1FTSS_FTSS1                2260
#define RG1FTSS2                      2261
#define PRG1FTSS_FTSS2                2262
#define RG1FTSS3                      2263
#define PRG1FTSS_FTSS3                2264
#define PRG1INS                       2265
#define PRG1INS_INS                   2266
#define PRG1INS_INS0                  2267
#define RG1INS0                       2268
#define PRG1INS_INS1                  2269
#define RG1INS1                       2270
#define PRG1INS_INS2                  2271
#define RG1INS2                       2272
#define PRG1INS_INS3                  2273
#define RG1INS3                       2274
#define PRG1CON0                      2275
#define PRG1CON0_GO                   2276
#define RG1GO                         2277
#define RG1OS                         2278
#define PRG1CON0_OS                   2279
#define RG1MODE0                      2280
#define RG1MODE                       2281
#define PRG1CON0_MODE                 2282
#define PRG1CON0_MODE0                2283
#define RG1MODE1                      2284
#define PRG1CON0_MODE1                2285
#define PRG1CON0_REDG                 2286
#define RG1REDG                       2287
#define RG1FEDG                       2288
#define PRG1CON0_FEDG                 2289
#define PRG1CON0_EN                   2290
#define RG1EN                         2291
#define PRG1CON1                      2292
#define PRG1CON1_RPOL                 2293
#define RG1RPOL                       2294
#define PRG1CON1_FPOL                 2295
#define RG1FPOL                       2296
#define PRG1CON1_RDY                  2297
#define RG1RDY                        2298
#define PRG1CON2                      2299
#define RG1ISET0                      2300
#define PRG1CON2_ISET                 2301
#define RG1ISET                       2302
#define PRG1CON2_ISET0                2303
#define RG1ISET1                      2304
#define PRG1CON2_ISET1                2305
#define RG1ISET2                      2306
#define PRG1CON2_ISET2                2307
#define RG1ISET3                      2308
#define PRG1CON2_ISET3                2309
#define RG1ISET4                      2310
#define PRG1CON2_ISET4                2311
#define PRG2RTSS                      2312
#define PRG2RTSS_RTSS                 2313
#define RG2RTSS0                      2314
#define PRG2RTSS_RTSS0                2315
#define RG2RTSS1                      2316
#define PRG2RTSS_RTSS1                2317
#define RG2RTSS2                      2318
#define PRG2RTSS_RTSS2                2319
#define RG2RTSS3                      2320
#define PRG2RTSS_RTSS3                2321
#define PRG2FTSS                      2322
#define RG2FTSS0                      2323
#define PRG2FTSS_FTSS                 2324
#define PRG2FTSS_FTSS0                2325
#define RG2FTSS1                      2326
#define PRG2FTSS_FTSS1                2327
#define PRG2FTSS_FTSS2                2328
#define RG2FTSS2                      2329
#define RG2FTSS3                      2330
#define PRG2FTSS_FTSS3                2331
#define PRG2INS                       2332
#define PRG2INS_INS                   2333
#define PRG2INS_INS0                  2334
#define RG2INS0                       2335
#define PRG2INS_INS1                  2336
#define RG2INS1                       2337
#define PRG2INS_INS2                  2338
#define RG2INS2                       2339
#define PRG2INS_INS3                  2340
#define RG2INS3                       2341
#define PRG2CON0                      2342
#define PRG2CON0_GO                   2343
#define RG2GO                         2344
#define PRG2CON0_OS                   2345
#define RG2OS                         2346
#define RG2MODE0                      2347
#define PRG2CON0_MODE0                2348
#define RG2MODE                       2349
#define PRG2CON0_MODE                 2350
#define RG2MODE1                      2351
#define PRG2CON0_MODE1                2352
#define PRG2CON0_REDG                 2353
#define RG2REDG                       2354
#define RG2FEDG                       2355
#define PRG2CON0_FEDG                 2356
#define PRG2CON0_EN                   2357
#define RG2EN                         2358
#define PRG2CON1                      2359
#define PRG2CON1_RPOL                 2360
#define RG2RPOL                       2361
#define PRG2CON1_FPOL                 2362
#define RG2FPOL                       2363
#define PRG2CON1_RDY                  2364
#define RG2RDY                        2365
#define PRG2CON2                      2366
#define PRG2CON2_ISET                 2367
#define RG2ISET0                      2368
#define PRG2CON2_ISET0                2369
#define RG2ISET                       2370
#define RG2ISET1                      2371
#define PRG2CON2_ISET1                2372
#define RG2ISET2                      2373
#define PRG2CON2_ISET2                2374
#define RG2ISET3                      2375
#define PRG2CON2_ISET3                2376
#define PRG2CON2_ISET4                2377
#define RG2ISET4                      2378
#define PWMEN                         2379
#define MPWM5EN                       2380
#define MPWM6EN                       2381
#define PWMLD                         2382
#define MPWM5LD                       2383
#define MPWM6LD                       2384
#define PWMOUT                        2385
#define MPWM5OUT                      2386
#define MPWM6OUT                      2387
#define PWM5PHL0                      2388
#define PWM5PHL_PH                    2389
#define PWM5PHL                       2390
#define PWM5PHL1                      2391
#define PWM5PHL2                      2392
#define PWM5PHL3                      2393
#define PWM5PHL4                      2394
#define PWM5PHL5                      2395
#define PWM5PHL6                      2396
#define PWM5PHL7                      2397
#define PWM5PHH0                      2398
#define PWM5PHH_PH                    2399
#define PWM5PHH                       2400
#define PWM5PHH1                      2401
#define PWM5PHH2                      2402
#define PWM5PHH3                      2403
#define PWM5PHH4                      2404
#define PWM5PHH5                      2405
#define PWM5PHH6                      2406
#define PWM5PHH7                      2407
#define PWM5DCL_DC                    2408
#define PWM5DCL                       2409
#define PWM5DCL0                      2410
#define PWM5DCL1                      2411
#define PWM5DCL2                      2412
#define PWM5DCL3                      2413
#define PWM5DCL4                      2414
#define PWM5DCL5                      2415
#define PWM5DCL6                      2416
#define PWM5DCL7                      2417
#define PWM5DCH_DC                    2418
#define PWM5DCH                       2419
#define PWM5DCH0                      2420
#define PWM5DCH1                      2421
#define PWM5DCH2                      2422
#define PWM5DCH3                      2423
#define PWM5DCH4                      2424
#define PWM5DCH5                      2425
#define PWM5DCH6                      2426
#define PWM5DCH7                      2427
#define PWM5PRL0                      2428
#define PWM5PRL_PR                    2429
#define PWM5PRL                       2430
#define PWM5PRL1                      2431
#define PWM5PRL2                      2432
#define PWM5PRL3                      2433
#define PWM5PRL4                      2434
#define PWM5PRL5                      2435
#define PWM5PRL6                      2436
#define PWM5PRL7                      2437
#define PWM5PRH_PR                    2438
#define PWM5PRH0                      2439
#define PWM5PRH                       2440
#define PWM5PRH1                      2441
#define PWM5PRH2                      2442
#define PWM5PRH3                      2443
#define PWM5PRH4                      2444
#define PWM5PRH5                      2445
#define PWM5PRH6                      2446
#define PWM5PRH7                      2447
#define PWM5OFL                       2448
#define PWM5OFL0                      2449
#define PWM5OFL_OF                    2450
#define PWM5OFL1                      2451
#define PWM5OFL2                      2452
#define PWM5OFL3                      2453
#define PWM5OFL4                      2454
#define PWM5OFL5                      2455
#define PWM5OFL6                      2456
#define PWM5OFL7                      2457
#define PWM5OFH_OF                    2458
#define PWM5OFH                       2459
#define PWM5OFH0                      2460
#define PWM5OFH1                      2461
#define PWM5OFH2                      2462
#define PWM5OFH3                      2463
#define PWM5OFH4                      2464
#define PWM5OFH5                      2465
#define PWM5OFH6                      2466
#define PWM5OFH7                      2467
#define PWM5TMRL_TMR                  2468
#define PWM5TMRL                      2469
#define PWM5TMRL0                     2470
#define PWM5TMRL1                     2471
#define PWM5TMRL2                     2472
#define PWM5TMRL3                     2473
#define PWM5TMRL4                     2474
#define PWM5TMRL5                     2475
#define PWM5TMRL6                     2476
#define PWM5TMRL7                     2477
#define PWM5TMRH0                     2478
#define PWM5TMRH                      2479
#define PWM5TMRH_TMR                  2480
#define PWM5TMRH1                     2481
#define PWM5TMRH2                     2482
#define PWM5TMRH3                     2483
#define PWM5TMRH4                     2484
#define PWM5TMRH5                     2485
#define PWM5TMRH6                     2486
#define PWM5TMRH7                     2487
#define PWM5CON                       2488
#define PWM5MODE0                     2489
#define PWM5CON_MODE                  2490
#define PWM5CON_MODE0                 2491
#define PWM5MODE                      2492
#define PWM5MODE1                     2493
#define PWM5CON_MODE1                 2494
#define PWM5POL                       2495
#define PWM5CON_POL                   2496
#define PWM5OUT                       2497
#define PWM5CON_OUT                   2498
#define PWM5EN                        2499
#define PWM5CON_EN                    2500
#define PWM5INTE                      2501
#define PWM5INTE_PRIE                 2502
#define PWM5PRIE                      2503
#define PWM5INTE_DCIE                 2504
#define PWM5DCIE                      2505
#define PWM5INTE_PHIE                 2506
#define PWM5PHIE                      2507
#define PWM5OFIE                      2508
#define PWM5INTE_OFIE                 2509
#define PWM5INTF                      2510
#define PWM5INTF_PRIF                 2511
#define PWM5PRIF                      2512
#define PWM5INTF_DCIF                 2513
#define PWM5DCIF                      2514
#define PWM5INTF_PHIF                 2515
#define PWM5PHIF                      2516
#define PWM5OFIF                      2517
#define PWM5INTF_OFIF                 2518
#define PWM5CLKCON                    2519
#define PWM5CS0                       2520
#define PWM5CLKCON_CS0                2521
#define PWM5CS                        2522
#define PWM5CLKCON_CS                 2523
#define PWM5CS1                       2524
#define PWM5CLKCON_CS1                2525
#define PWM5CS2                       2526
#define PWM5CLKCON_CS2                2527
#define PWM5PS                        2528
#define PWM5CLKCON_PS0                2529
#define PWM5PS0                       2530
#define PWM5CLKCON_PS                 2531
#define PWM5CLKCON_PS1                2532
#define PWM5PS1                       2533
#define PWM5CLKCON_PS2                2534
#define PWM5PS2                       2535
#define PWM5LDCON                     2536
#define PWM5LDCON_LDS                 2537
#define PWM5LDCON_LDS0                2538
#define PWM5LDS                       2539
#define PWM5LDS0                      2540
#define PWM5LDCON_LDT                 2541
#define PWM5LDM                       2542
#define PWM5LDCON_LDA                 2543
#define PWM5LD                        2544
#define PWM5OFCON                     2545
#define PWM5OFCON_OFS0                2546
#define PWM5OFCON_OFS                 2547
#define PWM5OFS0                      2548
#define PWM5OFS                       2549
#define PWM5OFCON_OFO                 2550
#define PWM5OFMC                      2551
#define PWM5OFM                       2552
#define PWM5OFM0                      2553
#define PWM5OFCON_OFM                 2554
#define PWM5OFCON_OFM0                2555
#define PWM5OFM1                      2556
#define PWM5OFCON_OFM1                2557
#define PWM6PHL                       2558
#define PWM6PHL_PH                    2559
#define PWM6PHL0                      2560
#define PWM6PHL1                      2561
#define PWM6PHL2                      2562
#define PWM6PHL3                      2563
#define PWM6PHL4                      2564
#define PWM6PHL5                      2565
#define PWM6PHL6                      2566
#define PWM6PHL7                      2567
#define PWM6PHH0                      2568
#define PWM6PHH                       2569
#define PWM6PHH_PH                    2570
#define PWM6PHH1                      2571
#define PWM6PHH2                      2572
#define PWM6PHH3                      2573
#define PWM6PHH4                      2574
#define PWM6PHH5                      2575
#define PWM6PHH6                      2576
#define PWM6PHH7                      2577
#define PWM6DCL                       2578
#define PWM6DCL_DC                    2579
#define PWM6DCL0                      2580
#define PWM6DCL1                      2581
#define PWM6DCL2                      2582
#define PWM6DCL3                      2583
#define PWM6DCL4                      2584
#define PWM6DCL5                      2585
#define PWM6DCL6                      2586
#define PWM6DCL7                      2587
#define PWM6DCH                       2588
#define PWM6DCH0                      2589
#define PWM6DCH_DC                    2590
#define PWM6DCH1                      2591
#define PWM6DCH2                      2592
#define PWM6DCH3                      2593
#define PWM6DCH4                      2594
#define PWM6DCH5                      2595
#define PWM6DCH6                      2596
#define PWM6DCH7                      2597
#define PWM6PRL0                      2598
#define PWM6PRL                       2599
#define PWM6PRL_PR                    2600
#define PWM6PRL1                      2601
#define PWM6PRL2                      2602
#define PWM6PRL3                      2603
#define PWM6PRL4                      2604
#define PWM6PRL5                      2605
#define PWM6PRL6                      2606
#define PWM6PRL7                      2607
#define PWM6PRH_PR                    2608
#define PWM6PRH                       2609
#define PWM6PRH0                      2610
#define PWM6PRH1                      2611
#define PWM6PRH2                      2612
#define PWM6PRH3                      2613
#define PWM6PRH4                      2614
#define PWM6PRH5                      2615
#define PWM6PRH6                      2616
#define PWM6PRH7                      2617
#define PWM6OFL                       2618
#define PWM6OFL0                      2619
#define PWM6OFL_OF                    2620
#define PWM6OFL1                      2621
#define PWM6OFL2                      2622
#define PWM6OFL3                      2623
#define PWM6OFL4                      2624
#define PWM6OFL5                      2625
#define PWM6OFL6                      2626
#define PWM6OFL7                      2627
#define PWM6OFH                       2628
#define PWM6OFH_OF                    2629
#define PWM6OFH0                      2630
#define PWM6OFH1                      2631
#define PWM6OFH2                      2632
#define PWM6OFH3                      2633
#define PWM6OFH4                      2634
#define PWM6OFH5                      2635
#define PWM6OFH6                      2636
#define PWM6OFH7                      2637
#define PWM6TMRL_TMR                  2638
#define PWM6TMRL                      2639
#define PWM6TMRL0                     2640
#define PWM6TMRL1                     2641
#define PWM6TMRL2                     2642
#define PWM6TMRL3                     2643
#define PWM6TMRL4                     2644
#define PWM6TMRL5                     2645
#define PWM6TMRL6                     2646
#define PWM6TMRL7                     2647
#define PWM6TMRH_TMR                  2648
#define PWM6TMRH0                     2649
#define PWM6TMRH                      2650
#define PWM6TMRH1                     2651
#define PWM6TMRH2                     2652
#define PWM6TMRH3                     2653
#define PWM6TMRH4                     2654
#define PWM6TMRH5                     2655
#define PWM6TMRH6                     2656
#define PWM6TMRH7                     2657
#define PWM6CON                       2658
#define PWM6CON_MODE0                 2659
#define PWM6CON_MODE                  2660
#define PWM6MODE                      2661
#define PWM6MODE0                     2662
#define PWM6CON_MODE1                 2663
#define PWM6MODE1                     2664
#define PWM6POL                       2665
#define PWM6CON_POL                   2666
#define PWM6OUT                       2667
#define PWM6CON_OUT                   2668
#define PWM6EN                        2669
#define PWM6CON_EN                    2670
#define PWM6INTE                      2671
#define PWM6PRIE                      2672
#define PWM6INTE_PRIE                 2673
#define PWM6DCIE                      2674
#define PWM6INTE_DCIE                 2675
#define PWM6PHIE                      2676
#define PWM6INTE_PHIE                 2677
#define PWM6INTE_OFIE                 2678
#define PWM6OFIE                      2679
#define PWM6INTF                      2680
#define PWM6INTF_PRIF                 2681
#define PWM6PRIF                      2682
#define PWM6INTF_DCIF                 2683
#define PWM6DCIF                      2684
#define PWM6PHIF                      2685
#define PWM6INTF_PHIF                 2686
#define PWM6OFIF                      2687
#define PWM6INTF_OFIF                 2688
#define PWM6CLKCON                    2689
#define PWM6CLKCON_CS                 2690
#define PWM6CS                        2691
#define PWM6CLKCON_CS0                2692
#define PWM6CS0                       2693
#define PWM6CLKCON_CS1                2694
#define PWM6CS1                       2695
#define PWM6CLKCON_CS2                2696
#define PWM6CS2                       2697
#define PWM6PS                        2698
#define PWM6PS0                       2699
#define PWM6CLKCON_PS0                2700
#define PWM6CLKCON_PS                 2701
#define PWM6PS1                       2702
#define PWM6CLKCON_PS1                2703
#define PWM6CLKCON_PS2                2704
#define PWM6PS2                       2705
#define PWM6LDCON                     2706
#define PWM6LDS                       2707
#define PWM6LDCON_LDS                 2708
#define PWM6LDCON_LDS0                2709
#define PWM6LDS0                      2710
#define PWM6LDCON_LDT                 2711
#define PWM6LDM                       2712
#define PWM6LD                        2713
#define PWM6LDCON_LDA                 2714
#define PWM6OFCON                     2715
#define PWM6OFS0                      2716
#define PWM6OFCON_OFS                 2717
#define PWM6OFCON_OFS0                2718
#define PWM6OFS                       2719
#define PWM6OFCON_OFO                 2720
#define PWM6OFMC                      2721
#define PWM6OFM                       2722
#define PWM6OFCON_OFM                 2723
#define PWM6OFM0                      2724
#define PWM6OFCON_OFM0                2725
#define PWM6OFM1                      2726
#define PWM6OFCON_OFM1                2727
#define PPSLOCK                       2728
#define PPSLOCKED                     2729
#define INTPPS                        2730
#define T0CKIPPS                      2731
#define T1CKIPPS                      2732
#define T1GPPS                        2733
#define CCP1PPS                       2734
#define CCP2PPS                       2735
#define COG1INPPS                     2736
#define COG2INPPS                     2737
#define T2INPPS                       2738
#define T3CKIPPS                      2739
#define T3GPPS                        2740
#define T4INPPS                       2741
#define T5CKIPPS                      2742
#define T5GPPS                        2743
#define T6INPPS                       2744
#define SSPCLKPPS                     2745
#define SSPDATPPS                     2746
#define SSPSSPPS                      2747
#define RXPPS                         2748
#define CKPPS                         2749
#define CLCIN0PPS                     2750
#define CLCIN1PPS                     2751
#define CLCIN2PPS                     2752
#define CLCIN3PPS                     2753
#define PRG1RPPS                      2754
#define PRG1FPPS                      2755
#define PRG2RPPS                      2756
#define PRG2FPPS                      2757
#define MD1CHPPS                      2758
#define MD1CLPPS                      2759
#define MD1MODPPS                     2760
#define MD2CHPPS                      2761
#define MD2CLPPS                      2762
#define MD2MODPPS                     2763
#define RA0PPS                        2764
