tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1769_tdd.h
#define RA1PPS                        2765
#define RA2PPS                        2766
#define RA4PPS                        2767
#define RA5PPS                        2768
#define RB4PPS                        2769
#define RB5PPS                        2770
#define RB6PPS                        2771
#define RB7PPS                        2772
#define RC0PPS                        2773
#define RC1PPS                        2774
#define RC2PPS                        2775
#define RC3PPS                        2776
#define RC4PPS                        2777
#define RC5PPS                        2778
#define RC6PPS                        2779
#define RC7PPS                        2780
#define CLCDATA                       2781
#define MCLC1OUT                      2782
#define MCLC2OUT                      2783
#define MCLC3OUT                      2784
#define CLC1CON                       2785
#define CLC1CON_MODE                  2786
#define LC1MODE0                      2787
#define LC1MODE                       2788
#define CLC1CON_MODE0                 2789
#define LC1MODE1                      2790
#define CLC1CON_MODE1                 2791
#define LC1MODE2                      2792
#define CLC1CON_MODE2                 2793
#define LC1INTN                       2794
#define CLC1CON_INTN                  2795
#define LC1INTP                       2796
#define CLC1CON_INTP                  2797
#define LC1OUT                        2798
#define CLC1CON_OUT                   2799
#define LC1EN                         2800
#define CLC1CON_EN                    2801
#define CLC1POL                       2802
#define LC1G1POL                      2803
#define CLC1POL_G1POL                 2804
#define CLC1POL_G2POL                 2805
#define LC1G2POL                      2806
#define LC1G3POL                      2807
#define CLC1POL_G3POL                 2808
#define LC1G4POL                      2809
#define CLC1POL_G4POL                 2810
#define CLC1POL_POL                   2811
#define LC1POL                        2812
#define CLC1SEL0                      2813
#define CLC1SEL0_D1S0                 2814
#define LC1D1S                        2815
#define LC1D1S0                       2816
#define CLC1SEL0_D1S                  2817
#define CLC1SEL0_D1S1                 2818
#define LC1D1S1                       2819
#define CLC1SEL0_D1S2                 2820
#define LC1D1S2                       2821
#define CLC1SEL0_D1S3                 2822
#define LC1D1S3                       2823
#define CLC1SEL0_D1S4                 2824
#define LC1D1S4                       2825
#define CLC1SEL1                      2826
#define CLC1SEL1_D2S0                 2827
#define CLC1SEL1_D2S                  2828
#define LC1D2S                        2829
#define LC1D2S0                       2830
#define CLC1SEL1_D2S1                 2831
#define LC1D2S1                       2832
#define LC1D2S2                       2833
#define CLC1SEL1_D2S2                 2834
#define LC1D2S3                       2835
#define CLC1SEL1_D2S3                 2836
#define LC1D2S4                       2837
#define CLC1SEL1_D2S4                 2838
#define CLC1SEL2                      2839
#define LC1D3S0                       2840
#define CLC1SEL2_D3S                  2841
#define LC1D3S                        2842
#define CLC1SEL2_D3S0                 2843
#define LC1D3S1                       2844
#define CLC1SEL2_D3S1                 2845
#define LC1D3S2                       2846
#define CLC1SEL2_D3S2                 2847
#define LC1D3S3                       2848
#define CLC1SEL2_D3S3                 2849
#define LC1D3S4                       2850
#define CLC1SEL2_D3S4                 2851
#define CLC1SEL3                      2852
#define CLC1SEL3_D4S                  2853
#define LC1D4S                        2854
#define LC1D4S0                       2855
#define CLC1SEL3_D4S0                 2856
#define CLC1SEL3_D4S1                 2857
#define LC1D4S1                       2858
#define LC1D4S2                       2859
#define CLC1SEL3_D4S2                 2860
#define LC1D4S3                       2861
#define CLC1SEL3_D4S3                 2862
#define LC1D4S4                       2863
#define CLC1SEL3_D4S4                 2864
#define CLC1GLS0                      2865
#define CLC1GLS0_D1N                  2866
#define LC1G1D1N                      2867
#define CLC1GLS0_D1T                  2868
#define LC1G1D1T                      2869
#define LC1G1D2N                      2870
#define CLC1GLS0_D2N                  2871
#define LC1G1D2T                      2872
#define CLC1GLS0_D2T                  2873
#define CLC1GLS0_D3N                  2874
#define LC1G1D3N                      2875
#define CLC1GLS0_D3T                  2876
#define LC1G1D3T                      2877
#define CLC1GLS0_D4N                  2878
#define LC1G1D4N                      2879
#define CLC1GLS0_D4T                  2880
#define LC1G1D4T                      2881
#define CLC1GLS1                      2882
#define CLC1GLS1_D1N                  2883
#define LC1G2D1N                      2884
#define LC1G2D1T                      2885
#define CLC1GLS1_D1T                  2886
#define CLC1GLS1_D2N                  2887
#define LC1G2D2N                      2888
#define LC1G2D2T                      2889
#define CLC1GLS1_D2T                  2890
#define CLC1GLS1_D3N                  2891
#define LC1G2D3N                      2892
#define LC1G2D3T                      2893
#define CLC1GLS1_D3T                  2894
#define CLC1GLS1_D4N                  2895
#define LC1G2D4N                      2896
#define LC1G2D4T                      2897
#define CLC1GLS1_D4T                  2898
#define CLC1GLS2                      2899
#define CLC1GLS2_D1N                  2900
#define LC1G3D1N                      2901
#define LC1G3D1T                      2902
#define CLC1GLS2_D1T                  2903
#define LC1G3D2N                      2904
#define CLC1GLS2_D2N                  2905
#define LC1G3D2T                      2906
#define CLC1GLS2_D2T                  2907
#define CLC1GLS2_D3N                  2908
#define LC1G3D3N                      2909
#define LC1G3D3T                      2910
#define CLC1GLS2_D3T                  2911
#define LC1G3D4N                      2912
#define CLC1GLS2_D4N                  2913
#define LC1G3D4T                      2914
#define CLC1GLS2_D4T                  2915
#define CLC1GLS3                      2916
#define LC1G4D1N                      2917
#define CLC1GLS3_G4D1N                2918
#define LC1G4D1T                      2919
#define CLC1GLS3_G4D1T                2920
#define CLC1GLS3_G4D2N                2921
#define LC1G4D2N                      2922
#define CLC1GLS3_G4D2T                2923
#define LC1G4D2T                      2924
#define LC1G4D3N                      2925
#define CLC1GLS3_G4D3N                2926
#define LC1G4D3T                      2927
#define CLC1GLS3_G4D3T                2928
#define CLC1GLS3_G4D4N                2929
#define LC1G4D4N                      2930
#define CLC1GLS3_G4D4T                2931
#define LC1G4D4T                      2932
#define CLC2CON                       2933
#define LC2MODE0                      2934
#define CLC2CON_MODE                  2935
#define LC2MODE                       2936
#define CLC2CON_MODE0                 2937
#define LC2MODE1                      2938
#define CLC2CON_MODE1                 2939
#define LC2MODE2                      2940
#define CLC2CON_MODE2                 2941
#define LC2INTN                       2942
#define CLC2CON_INTN                  2943
#define LC2INTP                       2944
#define CLC2CON_INTP                  2945
#define CLC2CON_OUT                   2946
#define LC2OUT                        2947
#define CLC2CON_EN                    2948
#define LC2EN                         2949
#define CLC2POL                       2950
#define LC2G1POL                      2951
#define CLC2POL_G1POL                 2952
#define LC2G2POL                      2953
#define CLC2POL_G2POL                 2954
#define LC2G3POL                      2955
#define CLC2POL_G3POL                 2956
#define LC2G4POL                      2957
#define CLC2POL_G4POL                 2958
#define CLC2POL_POL                   2959
#define LC2POL                        2960
#define CLC2SEL0                      2961
#define CLC2SEL0_D1S                  2962
#define LC2D1S0                       2963
#define CLC2SEL0_D1S0                 2964
#define LC2D1S                        2965
#define LC2D1S1                       2966
#define CLC2SEL0_D1S1                 2967
#define LC2D1S2                       2968
#define CLC2SEL0_D1S2                 2969
#define CLC2SEL0_D1S3                 2970
#define LC2D1S3                       2971
#define LC2D1S4                       2972
#define CLC2SEL0_D1S4                 2973
#define CLC2SEL1                      2974
#define LC2D2S0                       2975
#define CLC2SEL1_D2S0                 2976
#define LC2D2S                        2977
#define CLC2SEL1_D2S                  2978
#define LC2D2S1                       2979
#define CLC2SEL1_D2S1                 2980
#define LC2D2S2                       2981
#define CLC2SEL1_D2S2                 2982
#define LC2D2S3                       2983
#define CLC2SEL1_D2S3                 2984
#define LC2D2S4                       2985
#define CLC2SEL1_D2S4                 2986
#define CLC2SEL2                      2987
#define CLC2SEL2_D3S                  2988
#define LC2D3S0                       2989
#define CLC2SEL2_D3S0                 2990
#define LC2D3S                        2991
#define CLC2SEL2_D3S1                 2992
#define LC2D3S1                       2993
#define LC2D3S2                       2994
#define CLC2SEL2_D3S2                 2995
#define LC2D3S3                       2996
#define CLC2SEL2_D3S3                 2997
#define LC2D3S4                       2998
#define CLC2SEL2_D3S4                 2999
#define CLC2SEL3                      3000
#define LC2D4S                        3001
#define LC2D4S0                       3002
#define CLC2SEL3_D4S                  3003
#define CLC2SEL3_D4S0                 3004
#define LC2D4S1                       3005
#define CLC2SEL3_D4S1                 3006
#define LC2D4S2                       3007
#define CLC2SEL3_D4S2                 3008
#define CLC2SEL3_D4S3                 3009
#define LC2D4S3                       3010
#define LC2D4S4                       3011
#define CLC2SEL3_D4S4                 3012
#define CLC2GLS0                      3013
#define LC2G1D1N                      3014
#define CLC2GLS0_D1N                  3015
#define CLC2GLS0_D1T                  3016
#define LC2G1D1T                      3017
#define LC2G1D2N                      3018
#define CLC2GLS0_D2N                  3019
#define CLC2GLS0_D2T                  3020
#define LC2G1D2T                      3021
#define LC2G1D3N                      3022
#define CLC2GLS0_D3N                  3023
#define CLC2GLS0_D3T                  3024
#define LC2G1D3T                      3025
#define LC2G1D4N                      3026
#define CLC2GLS0_D4N                  3027
#define CLC2GLS0_D4T                  3028
#define LC2G1D4T                      3029
#define CLC2GLS1                      3030
#define CLC2GLS1_D1N                  3031
#define LC2G2D1N                      3032
#define CLC2GLS1_D1T                  3033
#define LC2G2D1T                      3034
#define CLC2GLS1_D2N                  3035
#define LC2G2D2N                      3036
#define CLC2GLS1_D2T                  3037
#define LC2G2D2T                      3038
#define LC2G2D3N                      3039
#define CLC2GLS1_D3N                  3040
#define LC2G2D3T                      3041
#define CLC2GLS1_D3T                  3042
#define LC2G2D4N                      3043
#define CLC2GLS1_D4N                  3044
#define LC2G2D4T                      3045
#define CLC2GLS1_D4T                  3046
#define CLC2GLS2                      3047
#define LC2G3D1N                      3048
#define CLC2GLS2_D1N                  3049
#define CLC2GLS2_D1T                  3050
#define LC2G3D1T                      3051
#define CLC2GLS2_D2N                  3052
#define LC2G3D2N                      3053
#define LC2G3D2T                      3054
#define CLC2GLS2_D2T                  3055
#define CLC2GLS2_D3N                  3056
#define LC2G3D3N                      3057
#define CLC2GLS2_D3T                  3058
#define LC2G3D3T                      3059
#define CLC2GLS2_D4N                  3060
#define LC2G3D4N                      3061
#define LC2G3D4T                      3062
#define CLC2GLS2_D4T                  3063
#define CLC2GLS3                      3064
#define LC2G4D1N                      3065
#define CLC2GLS3_G4D1N                3066
#define CLC2GLS3_G4D1T                3067
#define LC2G4D1T                      3068
#define CLC2GLS3_G4D2N                3069
#define LC2G4D2N                      3070
#define LC2G4D2T                      3071
#define CLC2GLS3_G4D2T                3072
#define CLC2GLS3_G4D3N                3073
#define LC2G4D3N                      3074
#define CLC2GLS3_G4D3T                3075
#define LC2G4D3T                      3076
#define LC2G4D4N                      3077
#define CLC2GLS3_G4D4N                3078
#define CLC2GLS3_G4D4T                3079
#define LC2G4D4T                      3080
#define CLC3CON                       3081
#define LC3MODE                       3082
#define CLC3CON_MODE0                 3083
#define LC3MODE0                      3084
#define CLC3CON_MODE                  3085
#define CLC3CON_MODE1                 3086
#define LC3MODE1                      3087
#define CLC3CON_MODE2                 3088
#define LC3MODE2                      3089
#define LC3INTN                       3090
#define CLC3CON_INTN                  3091
#define LC3INTP                       3092
#define CLC3CON_INTP                  3093
#define LC3OUT                        3094
#define CLC3CON_OUT                   3095
#define LC3EN                         3096
#define CLC3CON_EN                    3097
#define CLC3POL                       3098
#define LC3G1POL                      3099
#define CLC3POL_G1POL                 3100
#define LC3G2POL                      3101
#define CLC3POL_G2POL                 3102
#define CLC3POL_G3POL                 3103
#define LC3G3POL                      3104
#define LC3G4POL                      3105
#define CLC3POL_G4POL                 3106
#define LC3POL                        3107
#define CLC3POL_POL                   3108
#define CLC3SEL0                      3109
#define CLC3SEL0_D1S0                 3110
#define LC3D1S0                       3111
#define LC3D1S                        3112
#define CLC3SEL0_D1S                  3113
#define LC3D1S1                       3114
#define CLC3SEL0_D1S1                 3115
#define LC3D1S2                       3116
#define CLC3SEL0_D1S2                 3117
#define LC3D1S3                       3118
#define CLC3SEL0_D1S3                 3119
#define LC3D1S4                       3120
#define CLC3SEL0_D1S4                 3121
#define CLC3SEL1                      3122
#define CLC3SEL1_D2S                  3123
#define CLC3SEL1_D2S0                 3124
#define LC3D2S                        3125
#define LC3D2S0                       3126
#define CLC3SEL1_D2S1                 3127
#define LC3D2S1                       3128
#define CLC3SEL1_D2S2                 3129
#define LC3D2S2                       3130
#define CLC3SEL1_D2S3                 3131
#define LC3D2S3                       3132
#define LC3D2S4                       3133
#define CLC3SEL1_D2S4                 3134
#define CLC3SEL2                      3135
#define CLC3SEL2_D3S0                 3136
#define LC3D3S                        3137
#define CLC3SEL2_D3S                  3138
#define LC3D3S0                       3139
#define LC3D3S1                       3140
#define CLC3SEL2_D3S1                 3141
#define LC3D3S2                       3142
#define CLC3SEL2_D3S2                 3143
#define LC3D3S3                       3144
#define CLC3SEL2_D3S3                 3145
#define LC3D3S4                       3146
#define CLC3SEL2_D3S4                 3147
#define CLC3SEL3                      3148
#define CLC3SEL3_D4S0                 3149
#define LC3D4S0                       3150
#define LC3D4S                        3151
#define CLC3SEL3_D4S                  3152
#define LC3D4S1                       3153
#define CLC3SEL3_D4S1                 3154
#define LC3D4S2                       3155
#define CLC3SEL3_D4S2                 3156
#define LC3D4S3                       3157
#define CLC3SEL3_D4S3                 3158
#define LC3D4S4                       3159
#define CLC3SEL3_D4S4                 3160
#define CLC3GLS0                      3161
#define CLC3GLS0_D1N                  3162
#define LC3G1D1N                      3163
#define LC3G1D1T                      3164
#define CLC3GLS0_D1T                  3165
#define LC3G1D2N                      3166
#define CLC3GLS0_D2N                  3167
#define CLC3GLS0_D2T                  3168
#define LC3G1D2T                      3169
#define CLC3GLS0_D3N                  3170
#define LC3G1D3N                      3171
#define LC3G1D3T                      3172
#define CLC3GLS0_D3T                  3173
#define CLC3GLS0_D4N                  3174
#define LC3G1D4N                      3175
#define CLC3GLS0_D4T                  3176
#define LC3G1D4T                      3177
#define CLC3GLS1                      3178
#define LC3G2D1N                      3179
#define CLC3GLS1_D1N                  3180
#define CLC3GLS1_D1T                  3181
#define LC3G2D1T                      3182
#define LC3G2D2N                      3183
#define CLC3GLS1_D2N                  3184
#define LC3G2D2T                      3185
#define CLC3GLS1_D2T                  3186
#define LC3G2D3N                      3187
#define CLC3GLS1_D3N                  3188
#define CLC3GLS1_D3T                  3189
#define LC3G2D3T                      3190
#define LC3G2D4N                      3191
#define CLC3GLS1_D4N                  3192
#define LC3G2D4T                      3193
#define CLC3GLS1_D4T                  3194
#define CLC3GLS2                      3195
#define LC3G3D1N                      3196
#define CLC3GLS2_D1N                  3197
#define LC3G3D1T                      3198
#define CLC3GLS2_D1T                  3199
#define CLC3GLS2_D2N                  3200
#define LC3G3D2N                      3201
#define CLC3GLS2_D2T                  3202
#define LC3G3D2T                      3203
#define CLC3GLS2_D3N                  3204
#define LC3G3D3N                      3205
#define LC3G3D3T                      3206
#define CLC3GLS2_D3T                  3207
#define CLC3GLS2_D4N                  3208
#define LC3G3D4N                      3209
#define CLC3GLS2_D4T                  3210
#define LC3G3D4T                      3211
#define CLC3GLS3                      3212
#define LC3G4D1N                      3213
#define CLC3GLS3_G4D1N                3214
#define LC3G4D1T                      3215
#define CLC3GLS3_G4D1T                3216
#define LC3G4D2N                      3217
#define CLC3GLS3_G4D2N                3218
#define CLC3GLS3_G4D2T                3219
#define LC3G4D2T                      3220
#define LC3G4D3N                      3221
#define CLC3GLS3_G4D3N                3222
#define CLC3GLS3_G4D3T                3223
#define LC3G4D3T                      3224
#define LC3G4D4N                      3225
#define CLC3GLS3_G4D4N                3226
#define LC3G4D4T                      3227
#define CLC3GLS3_G4D4T                3228
#define STATUS_SHAD                   3229
#define C_SHAD                        3230
#define DC_SHAD                       3231
#define Z_SHAD                        3232
#define WREG_SHAD                     3233
#define BSR_SHAD                      3234
#define PCLATH_SHAD                   3235
#define FSR0L_SHAD                    3236
#define FSR0H_SHAD                    3237
#define FSR1L_SHAD                    3238
#define FSR1H_SHAD                    3239
#define STKPTR                        3240
#define TOSL                          3241
#define TOSH                          3242

#endif // _PIC16F1769_H_
